Tekla Open API Reference for Tekla Structures 2025
LoopEnumerator.MoveNext Method
 Moves to the next item in the enumerator.
 Namespace: Tekla.Structures.Solid
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool MoveNext()
Public Function MoveNext As Boolean
Return Value
Type: Boolean
False on failure.
Implements
IEnumerator.MoveNext()
See Also
Reference
LoopEnumerator Class
Tekla.Structures.Solid Namespace